using System;
using System.IO;
using System.Net.Http;
using System.Threading.Tasks;
using Newtonsoft.Json;
using Newtonsoft.Json.Linq;
using Telegram.Bot;
using Telegram.Bot.Types;
using File = System.IO.File;

namespace BotsController.Core.Commands
{
    public class JokeCommand : Command
    {
        public override string Name => @"анекдот";

        private readonly Random random = new Random();

        public override Task ExecuteAsync(Message message, TelegramBotClient botClient)
        {
            try
            {
                var joke = GetJoke().Result;
                return botClient.SendTextMessageAsync(message.Chat.Id, joke);
            }
            catch (Exception ex)
            {
                return botClient.SendTextMessageAsync(message.Chat.Id, "У мене нема настрою для анекдоту, розважай себе сам.");
            }
        }

        private async Task<string> GetJoke()
        {
            var allJokes = Jokes.Split(new[] { $"{Environment.NewLine}{Environment.NewLine}" }, StringSplitOptions.None);
            return allJokes[random.Next(allJokes.Length)];
        }


        private string Jokes { get; } = @"
– Вчора так напилися, що прямо з вікна запускали салат!
– Може, салют?
– Точно, салют.Крабовий …

– Моя маленька дочка відмовляється їсти рибу.Чим можна її замінити?
– Кішкою.Кішки дуже люблять рибу.

Дружина ввечері дивиться телик і їсть один бутерброд за іншим. Чоловік не витримує:
– Ти ж казала, що не будеш їсти після шостої.
– Угу.Це – п’ятий.

– Тобі купити що-небудь?
– Так!
– Що?
– Не знаю, але купи два!

Якщо жінка мовчить, значить вона або фарбує губи, або придумує чому чоловік знову винен.

У кого ще немає новорічного настрою – спробуйте з’їсти дощик з ялинки. Не знаю, як це працює, але моєму коту допомагає.

– Привіт дорогий! Що робиш?
– Кіно дивлюся.
– Знову гидоту якусь?
– Ні, німецьку мелодраму про безпорадну дівчині, у якої в ванній зірвало кран, і їй на допомогу прийшли чотири досвідчених сантехніка і електрик.

Іноді і чорний гумор – ознака світлого розуму.

– Дорогий, де ти був?
– Бігав!
– Дивно, але футболка зовсім не пахне … Дорогий, чому ти зблід?
Навіщо ти надів маску? Куди ти дзвониш ?!

Існує багато способів розважитися, наприклад, клеїти модельки. Але я – людина одружений, і клеїти модельок дружина мені, на жаль, не дозволяє.

Якщо у вас є дитина, і у нього в руках шоколад; значить все буде в шоколаді!

– Дівчина, можна вашу ручку? Яка витончена! Дістанеш мені з банки огірочок? . .

Прийдеш до столяра – кругом тирса валяються, до перукаря – волосся … А прийдеш в банк – грошей не видно.Ще й ручка прив’язана!

Хочеш грошей в 2 рази більше? Поклади їх перед дзеркалом.

– Допоможи мені, Господи! Є таки нічого, жити нема на що, ні рубля в кишені …
Голос з неба:
– Не бреши, Ізя!
– Так шо тепер, долари міняти, чи що?!

На ринку цінних паперів лідирує туалетна

Самоізоляція – це ознайомлювальний тур на пенсію.Грошей немає і зайнятися нічим.

Сміливість, мужність, справедливість – перші ознаки алкогольного сп’яніння

– У тебе МТС?
– Якби у мене був МТС, я б на Феррарі їздив і на Канарах жив.Це не в мене МТС, це я у МТС.

Пройшла акція день без мату!
– Це повністю паралізувало роботу всіх автосервісів;
– Застопорилися все вантажно-розвантажувальні роботи;
– Хокеїсти не зрозуміли тренера на установці перед матчем;
– Місцевий трудовик помер на вдиху;
– А звичайні мешканці не знали що відповісти на елементарне запитання “Де?”

Дорогі жінки, якщо чоловік нічого вам не дарує, розкидає всюди шкарпетки і сидить перед телевізором з пляшкою пива, значить, ви та єдина, з якою йому дійсно добре!

Дорогий! У тебе там в кишені 500 доларів лежить, можна я їх вже взяла?

Шеф на зборах:
– Шановні колеги! Хто з вас в цьому році швидше за всіх виконає план, той отримає від мене шоколадку!
– Шеф, нам би зарплату …
– Так, починається! Я вже купив шоколадки!

Заходить мужик в аптеку і щось тихо шепоче на вухо аптекаpю.Аптекаpь(на всю аптеку):- Та які ще захисні засоби, тут аптека, а не Міністеpство обоpони!

– Приходь сьогодні ввечері до мене – заночуємо, попустуємо!
– А тато з мамою дозволить ???
– Нє, з мамою звичайно не дозволить, зі мною будеш спати.

Директор цирку, дивлячись на виступ п’яного жонглера-еквілібриста, сказав, що виступати після нього клоуну – тільки ганьбитися.

Чоловік радісно повідомляє дружині: – А Мені теща на День Народження обіцяла «Порш Кайен»!
– Улюблений! Ти просто не розчув … напевно Борщ і хpен!

– Як ви з дружиною проводите вихідні?
– За принципом “пасатижі”.
– Це як?
– Перекусим і далі собі лежимо.

Всім мужикам з наявністю почуття гумору.
Підійдіть до будь-якої дівчини і скажіть:
– Дівчина, у вас найкрасивіше місце забруднилося!
А потім спостерігайте куди вона буде дивитися!

2-х річна внучка практично довела до інфаркту бабусю, бо цілий день ходила за нею по квартирі зі словами: «Молись і Кайся!»
До вечора з’ясувалося, що дитина просила включити мультик «Малюк» і Карлсон ».

Наречений виносить наречену з ЗАГСУ на руках.Вона йому на вухо:
– Вань, адже ми вже одружені?
– Так.
– Дай на шию пересяду.

На упаковці активованого вугілля: “Це вугілля не активоване. Щоб активувати вугілля, відправте SMS на номер 3434!”

Роскомнадзор опублікував повний список “піратських” сайтів … Спасибо !!! А то я втомився їх шукати по всьому інтернету.

Судячи з квитанції з ЖЕКу, з крана у мене тече “Боржомі”, сміття вивозять на “Лексусі”, домофон підключений до роумінгу, а сніг прибирає сам глава районної адміністрації.

Довго думала, що б таке подарувати чоловікові на день народження. Піну для гоління? Шкарпетки? .. Банально.Купила собі путівку до Таїланду! Нехай улюблений відпочине!

Мова в РАГСі – як ліцензійну угоду.Нікому не цікаво, але сказати “згоден” треба.

В магазині:
– Який у вас цікавий велосипед?
– Це велосипед-тандем.Ви можете на ньому вдвох поїхати зі своєю дружиною!
– Моя дружина не вміє їздити на велосипеді!
– Так це якраз ваш випадок, вона буде позаду просто крутити педалі!
– І правда, цікаво, скажіть, а передні педалі можна прибрати?

Вчора я відкрив для себе новий світ. Я почув, про що говорять у маршрутках і на зупинках громадського транспорту, як гудуть машини і лаються водії, як кондуктори вимагають заплатити за проїзд і виганяють п’яних з автобусів.
Я забув удома МР3 плеєр! ..

– Мама, що потрібно робити, щоб зберегти здоров’я і хороші відносини з чоловіком?
– Вчасно закривати рот, донечко!

Йдемо з донькою.
Вона каже: “Насті – 3 роки, а мені вже 4, ха-ха-ха!”
Я відповідаю: “А мені 28 років, ха-ха-ха!”
На що дочка каже: “28 років, матуся, – це вже ой-ой-ой, а не ха-ха-ха!”

– Ким ти станеш, онучок, коли виростеш?
– Коли я виросту, бабуся, я стану дідусем.

– Ви хто?
– Добра фея!
– А чому з сокирою ?!
– Настрій щось не дуже …

– Так у мене Інтернет мало того, що безлімітний, так ще і халявний.
– Це як?
– Та це все тато! Коли Інтернет підключали, він з сусідами зверху домовився, що підключать разом, а платити будуть вони-по парних місяцях, а ми по непарних.
– Ну і?
– Ну, так він з сусідами знизу домовився, що вони по непарних, а ми по парних!

Дві подруги фоткаются на телефон:
– Бл% ть, ну і рожа !!!
– Ти на мою подивися !!!
– А я на твою і дивилася.

– У тебе все подруги страшні!
– А у тебе всі друзі п’ють!
– Та тому що у тебе подруги страшні!

– Чому ці довбані мухи літають наді мною?
– А ти сама здогадайся …
– Я варення?
– Та ти оптиміст ….

Хреново – це коли крім кота навіть обійняти нікого, а ця скотина ще й виривається.

З вулиці прийшов шматок бруду … стверджує, що моя дитина … спробую відмити, по голосу начебто мій.

У магазині чоловік звертається до продавщиці:
– Здрастуйте, мені, будь ласка, 3 ящики горілки, 50 літрів пива, 5 коробок мартіні і 30 пачок презервативів.
– Ось будь ласка.
– Дякуємо.
– Молода людина, зачекайте!
– Що таке?
– Візьміть мене з собою!

Горілка – дивовижний напій: смак постійно один, а пригоди завжди різні !!!

Moя подрyгa … ЧУДО … Кажу їй: «Давай візьмемо таксі!» …
А онa: «Дaвай горілку … швидше paзвeзe! …»

Покупець:
– «Яйце відбірне». У кого відбирали-то?
Продавець:
– У курей, зрозуміло.
– А вони не чинили опір?
– Ті, хто чинив опір – продаються в сусідньому відділі.

Ти або приймай мене такою, яка я є, або приймай таблетки, щоб приймати мене такою, яка я є.

– Мені, будь ласка, заспокійливого.
– Вам в краплях або в таблетках?
– Чи не дратуй мене, падло!

Кореспондент цікавиться у спортсмена-велосипедиста:
– Ви, на жаль, не виграли гонку. Але, скажіть, як вам сподобалася сама гонка?
– Самогонка нам сподобалася, тому й не перемогли.

У мене дружина – мудра жінка! Навіть якщо ми з нею посварилися і не розмовляємо, мене завжди чекає вдома після роботи смачна вечеря: борщ, пельмені, компот! Щоправда, все в одній тарілці …

– Алло, лікарю, я по вашій раді купив клізму, куди її тепер?
– Налийте в неї води і засуньте її собі в зад.
– Доктор, я мабуть передзвоню, коли у вас буде гарний настрій …

На порозі церкви стоїть молодий дяк і курить косяк, регоче на все горло і каже: і сміх і гріх !!!!

– Ось бачиш, який ти! Собі взяв великий шматок м’яса, а мені залишив маленький …
– А ти як би зробила?
– Я, звичайно, взяла б собі маленький …
– Ну, а чого ж ти тоді кричиш, я тобі такий і дав!

– Блін, я жирна! Фу! Як огидно!
– Мила, не варто так сильно турбуватися: у тебе тільки дупа жирна і шия трохи, не наговорюй на себе.
– Взагалі-то я на себе курячий бульйон пролила … Шо ти там сказав ?! Шматок небіжчика!

Песиміст – завжди спить з ножем під подушкою.
Оптиміст – теж: раптом хтось з тортиком прийде.

– Алло, Чувак !! Приїжджай до нас на дачу!
– Не хочу!!!
– У нас тут багато пива, шашлик, і п’яні дівчата …
– Папа, я другий раз на цю фішку не куплюсь! Копайте картоплю самі!

– Я прошу у вас руки вашої дочки.
– А у вас що, своєю руки немає?
– Своя є, але вона вже втомилася.

– Йшов вчора вночі додому. Дівчина попереду мене додала крок, я теж пішов швидше, вона почала бігти, я теж побіг, вона закричала, я теж закричав наскільки можливо. Я навіть не бачив від кого ми бігли, але було в натурі страшно.

Думки домашнього кота:
– Господиня коханця привела. Всю ніч з нею спав. На моєму місці … Зараз на кухні закрилися, мене не пускають … З моєї миски, напевно, жере …

Жили у бабусі,
Два веселих гуся,
Відгодувала, зарубала,
Продала і в плюсі!

Мужик просидів весь день на рибалці, але так нічого і не спіймав. Тоді по дорозі додому він заходить на місцевий ринок, йде в рибний ряд і хоче купити у продавця карасів. А той йому каже:

– Мені тут дзвонила твоя дружина і сказала, що сьогодні вона б воліла судака.

Восьмиметровий карась, спійманий в Москві-річці, змусив рибалку виконати три його бажання.

– Хочу хом’яка.
– За ним треба доглядати, стежити, прибирати, регулярно годувати, міняти воду, грати з ним.
– Хочу стати хом’яком.

– Дорога! У мене є роги?
– Ні, милий, в кобелів тільки блохи.

Дорога редакція! Величезна подяка вам за рецепт. Авокадо ми замінили відвареною картоплею, а креветки – підсмаженим салом, але в цілому ваш рецепт салату з авокадо з креветками нам дуже сподобався.

Бригаді, що працює на дні кар’єру, повідомили, що привезли аванс. Так швидко по кар’єрних сходах не піднімалося ніхто.

Маленький хлопчик на прийомі у лікаря: – На що скаржишся?
– На маму! Вона мене лякає Бабою-Ягою.

– Ти будеш мені вірна?
– А ти один мене потягнеш?

Менеджер з продажу – це людина, яка розганяє тих, хто прийшов погрітися, питанням “Вам допомогти?”.

– Прийдеш до мене на весілля?
– Та чому б і ні.
– Відмінно. Значить, з нареченим питання вирішене!

Реклама. Туристичне агентство «Штукатур». За штуку доларів – тур в будь-яку точку світу!

Чоловік купив новий телевізор.
Дружина:
– Ой, а чому це на коробці келих намальований?
Чоловік:
– Це означає, що покупку треба обмити ..

– Ти поділяєш мою думку, милий?
– Так, люба. Я його поділяю і причому на дві частини. Першу я відкидаю повністю, а з другої я категорично не згоден.

– Що ви будете робити, якщо побачите зеленого чоловічка?
60% відповіли – кину пити!
30% – почну пити!
9% – піду на прийом до психіатра!
І тільки одна дівчина сказала: «Почну переходити дорогу!».

Дружина скаржиться чоловікові на поведінку їхнього сина:
– Він став просто нестерпний. Слухає тільки поради різних ідіотів. Поговори з ним, я прошу тебя !!!

Відповідаючи на запитання своїх дітей, не забувайте: все, що ви скажете, може бути використано проти вас.

– Вітаю вас, сусід. Я чув, ви одружилися.
– Невже навіть у вас чути?

Пара одружилася. До цього у нього і у неї вже було по дитині. З часом зробили спільного. Діти підросли, грають у дворі. Чоловік підзвіт дружину до вікна:
– Маш, гляди – твій і мій нашого херачат!

Учень запитує досвідченого винороба:
– Яким повинен бути льох, щоб вино в ньому добре дозріло?
– Міцно замкненим, – відповів той.

Немає нічого більш корисного в господарстві, ніж винуватий чоловік.

– Повісила на лобове скло талісман …, який притягує гроші … На наступний день в мене в’їхала інкасаторську машину … !!

– У коней – кобили .., – У биків – телиці .., – У псів – суки .., .- У дурнів-дури …
– Глянула на СВОГО – КОРОЛЬ !!!

ЗАПИС у дитини у щоденнику: “На уроці російської лаявся матом на букву” Х “… ВІДПОВІДЬ запис:” Заходи вжиті. “П” навішали! “.

Подруга – подрузі:
– Дивлюся, ти меблі переставила. За фен-шуй, напевно?
– Та ні, по п’яні.

Пап! Коли він буде просити моєї руки, не падай на коліна, і не ридай “Рятівник ти наш!”. Просто кивни.

Лeг чукча спати, каже своїй дружині:
– Постав мнe дружина – 2 склянки одна повнна  води, а одна порожня.
– Для чeго тeбe дві склянки?
– Дурна. Ось встану я вночі, захочу пити, а може і не захочу.

Шукаю чарівну супутницю для романтичного відпочинку на Південному березі …
Серерно-льодовитого океану.
Чукча.

Бачити нареченого у весільній сукні нареченої до весілля – погана прикмета.

В магазині:
– Вибачте, у нас немає здачі. Візьміть ось п’ять жуйок з Міккі Маусом.
– Я вам дитина, чи що ?! Дайте з Термінатором …

Впавший у воду шоколадний батончик викликав паніку в басейні.

Захворів мільйонер. Родичі зібралися біля ліжка хворого:
– Скажіть, доктор, надія є?
– Абсолютно ніякої! У нього звичайна застуда.

Якщо я вирішив нічого не робити – мене вже не зупинити …

У вагоні метро молода цікава жінка каже чоловікові, який пристрасно дивиться на неї:
– Молодий чоловіче, одягніть мене, мені виходити на наступній зупинці!

Яка велика різниця між словами “світла голова” і “блондинка”!

Чому дурнів більше ніж розумних?
Поки розумні думають, дурні розмножуються …

Комарам ціни б не було, якби вони не кров пили, а жир посмоктувати …

Мати синові:
– Кожна твоя витівка, це один сивий волосок на моїй голові.
Син, подивившись на сиву бабусю:
– Я дивлюся, ти в молодості теж нефігово чуділа.

Офигенная вещь домофон! Поки чоловік по сходах піднімається дружина встигає вимкнути комп і телевізор, пов’язати фартух, покласти трубку … і стоїть така, бідна посуд миє …

– Мамо, а чому на плиті так брудно?
– Тато яєчню посмажив.
– Без сковорідки?

– Скажіть, а для чого вам парасольку?
– Як для чого, … А раптом дощ піде.
– Хм … Я вперше бачу людину, яка боїться дощу в приміщенні.
– А я й не боюся. У мене ж є парасолька.

Нічна дискотека «Кому за 70» була нахабним чином зірвана п’яними 50-річними підлітками …

На пошті, жінка відправляє телеграму. Диктує текст телеграфістками:
Вітаю з Новим роком доньку Світлану, внучку Любочку й онука Сергійку …
Телеграфістка з подивом:
– Можна ж написати куди коротше. Приміром: “Вітаю всіх з Новим роком”.
– АГА !! Щас! Буду я ще зятя поздоровляти !!

Студентка приїжджає додому на канікули і кричить з порога:
– Мамо, а у мене тепер є хлопчик!
– Радість моя, і де він навчається?
– Ти що, йому всього два місяці!

Заїжджаю в нову квартиру.
Думаю: «Цікаво, тут хороша чутність?»
– Дуже, – відподає сусід через стінки.

Люто ненавиджу друзів чоловіка – я б їх усіх, гадів, одружила!

– Тато! А навіщо ти одружився нa мaме?
Чоловік обертається до дружини і каже:
– От бачиш, дaже дитина дивується!

Добра половина даішників бере хабарі, а зла половина відбирає права.

В Одесі на вокзалі уздовж перону йде мужик і монотонно бубонить:
– Газети, журнали, еpoтіка, гороскопи, анекдоти …
Покупець простягає мятую гривню:
– Анекдоти, будь ласка.
Мужик дивиться гривню на світло, ховає її в широкі армійські галіфе і каже:
– Значить так, слухай сюди – повертається мужик з відрядження …
Покупець очманілий думає: “Добре, що еротику не взяв …”

Сара продавцеві овочів і фруктів:
– Я замовляла у вас три кілограми слив! Я заплатила! А синочка приніс, я зважила-тільки два кіло? !!
Продавець:
– А ви синочку не зважили?

У дитячій кімнаті дружина годує доньку грудьми. Чоловік з тестем і племінником сидять на кухні. Чоловік заглядає в дитячу і запитує:
– Що там Аня робить?
Племінник відповідає:
– Поставила малу на зарядку.

– Рабинович, чому ви продаєте горілку “Абсолют” по десять, коли у Меерсона вона коштує п’ять?
– Ой, мені подобаються ці питання! Підіть і купіть горілку “Абсолют” у Меерсона!
– Але у Меерсона якраз зараз немає горілки “Абсолют”!
– Ну так коли і у мене не буде горілки “Абсолют”, я відразу буду продавати її за п’ять!

Телефонний дзвінок у квартирі Рабиновича:
– Вибачте будь ласка, вас турбує Софа.
– Вибачте, але Софа мене зовсім не турбує.

– Сарочка, а можна мені каву?
– Абрам! Я шо тобі, доктор? Звідки я знаю, можна тобі каву або не можна ?!

З роками любов до жінки переростає в кулінарно-побутову залежність.

У магазин приходить маленький Мойша.
– Мені три літри меду, простягає він банку продавщиці. Та наливає повну банку.
– А тато завтра прийде і заплатить.
– Ну ні, – забирає в нього банку продавщиця і виливає назад мед.
Мойша виходить на вулицю і заглядає в банку:
– Тато був прав, тут вистачить на два бутерброди.

Вчора всією фірмою дізналися, що хвилина сміху над начальником замінює місячну премію.

– Розочка, а що це у нас сьогодні на обід?
– Картопля в депресії.
– Як це?
– Ну, пюре. Начебто картопля, як картопля, але така пригнічена …

– Мойша, а шо ви завжди купуєте парна кількість квітів?
– Дуже просто. Просиш 6 троянд, на тебе співчутливо дивляться і роблять велику знижку. Дуже зручно: троє троянди – дружині, три – коханці …

– Що у вас є поїсти?
– На жаль, тільки гуляш.
– Але в меню значиться ціла дюжина блюд …
– Так це для збудження апетиту.

Дівчата, які носять взимку шкіряні куртки, міні-спідниці і капронові колготки, Ви … незамерзайку чи що … п’єте? …

– Абгам, догогой, що тобі пгіготовіть, кугочку або гибку?
– Гидота моя, мені все гавно.

 

Якщо у машини з буквою “У” включилися склоочисники, значить, вона зараз буде повертати.

Прийшли німці в село. Нікого немає. Дивляться, старий сидить на лавочці.
– Здорово, дід.
– Здорово.
– Як тебе, діду, звати?
– Іван.
– На, Іван, пряник. Покажеш, де партизани ховаються?
– Покажу, чого не показати.
– А як у тебе, Іван, прізвище?
– Сусанін.
– Віддай пряник. Самі знайдемо !!!

– Ізя запам’ятай: погано без дівчат – це ще добре. Ось, коли добре без дівчат – це вже погано!

Дівчина – Виходь за мене заміж!
Хлопець – що ти щойно сказала?
Дівчина – А що я сказала?
Хлопець – Виходь за мене заміж!
Дівчина – Я згодна!

Циля Соломонівна вчить внучку:
– Чоловіків треба, таки, запам’ятовувати по люстрам. Якщо пам’ятаєш, як виглядає люстра – значить чоловік був не дуже …

-А Ось цікаво, є таблетки від голоду?
-Є, Тільки вони великі.
-Так Дурниця, аби допомагали.
-Вони допомагають!
-А Як називаються?
-КОТЛЕТИ!

Ось ж життя! До 30 років доводиш, що ти вже доросла а після 30 – що ти ще й молода !! …

– Сарочка, з днем народження! І скільки вам стукнуло?
– Коли я виходила заміж за Семена, мені було 20, а йому 40, тобто я в два рази молодше. Зараз Семену 70, а мені, стало бути, 35!

Жінка в самому соку шукає соковижималку!

– Семен, скільки твоя мама повинна заплатити за 2 кілограми яблук, якщо 1 кг коштує 2 рубля?
– Не можу сказати пан учитель, моя мама завжди торгується.

До жінки його мрії вона трохи не домолчала.

Котиться Колобок, а назустріч йому слон … Так з’явилася Піца …

Урок в школі:
– Ізя, припустимо у тебе є шість яблук, половину ти віддав Абраму. Скільки яблук у тебе залишилося?
– П’ять з половиною.

– Чоловік! Шо ви ото цілу годину ходите, пробуєте і нічого не берете ?! Вам шо, таки нічого не подобається?
– Подобається!
– Шо, грошей немає ?!
– Є!
– Ну так купуйте!
– Навіщо?
– Шоби кушать!
– А я шо роблю?

Директор фірми натрапив на оголошення з продажу того ж, чим торгує він сам, тільки дешевше і вирішив подзвонити. І впізнав голос сторожа зі свого складу.

Зустрічаються Сара і Циля.
– Сарочка, чому ти така задумлива?
– Так от, сьогодні вранці Абрам пішов на роботу, раптом дзвінок у двері. Відкриваю – там наш сусід – Мойша, запитує: “Абрам вдома?”. Я відповідаю, що ні. Ну, він валить мене на диван і … поки всі сили у нас не вичерпалися!
– Прекрасно! Ну і про що ж тут замислюватися?
– А навіщо ж йому, все-таки, мій Абраша потрібен був?

Тато залишився з маленькою донькою один, і ввечері ніяк не може укласти її спати. Перепробував все. Донька каже:
– Пошепочи мені на вушко, як мамі.
Папа щось шепоче. Донька, засинаючи:
– Ні ні! Втомилася, як собака!

Ріелтор Яша, продав дві квартири з видом на море, на 18 поверсі, в споруджуваному 16-ти поверховому будинку.

Дістався у спадок чоловікові від моторошно багатою померлої тітки великий алмаз.
Ну, що з ним робити? Вирішив піти до ювеліра. Той уважно оглянув алмаз і вигукнув:
– Це – унікальний камінь! Він коштує шалених грошей! Я не візьмуся його обробляти! А раптом я щось не так зроблю, раптом помилюся! Ні, не візьмуся я його робити, і не вмовляйте!
Пішов чоловік до іншого майстра. Той теж відмовився, пославшись на ті ж причини.
Пішов до третього. Ним виявився старий єврей Ціперовіч. Він оглянув алмаз і крикнув хлопчикові, що сидів у кутку і обробному якесь колечко:
– Моня, хлопчик мій, зроби-ка ось цей камінчик! Чоловік (з тривогою в голосі):
– Послухайте, як ви можете довіряти вашому юному підручному ?! Хіба ви не знаєте, що це за алмаз ?! Його відмовилися обробляти досвідчені ювеліри!
Ціперовіч (спокійно):
– Ша, ша, люб’язний! Ви знаєте, що у вас за алмаз і скільки він коштує. Я знаю, що у вас за алмаз і скільки він коштує. А Моня не знає, он-таки зробить!

На вулиці ожеледь. Мрія про те, що всі чоловіки будуть біля моїх ніг, починає здійснюватися. Поки йшла на роботу, двом допомогла встати, а з одним навіть полежала.

Маленький Ізя ніколи не кричав в магазині дитячих іграшок: – Купи-купи-купи! Він починав з якою-небудь абстрактній теми, наприклад: – Тато, а твоє дитинство теж було важким і безрадісним?

– Дядя Ізя, – говорить Семочко, – велике спасибі за ту трубу, що ви мені подарували. Такий дорогий подарунок!
– Так, дурниця! Що там дорогого? 60 копійок.
– Але зате мама і тато щовечора дають мені рубль, щоб я не дудів.

– Немає настрою? З’їж шоколадку!
– Не допомагає!!!
– Запий коньяком !!!

Одеса. На балкон виходить мама і кричить:
– Аркаша! Додому!
Хлопчик піднімає голову і кричить у відповідь:
– Я замерз?
– Ні! Ти хочеш їсти!

Дружина – чоловікові:
– Моня! Ти навіщо намалював на холодильнику літеру “Ж”?
– Сарочка, це – не “Ж”, це – сніжинка.
– А п’яних гостей ти про це попередив?

На кухні Одеської комуналки:
– Сарочка, якщо ви погодитеся, щоб я посмажила яєчню на вашому салі, я
дозволю вам зварити ваше м’ясо в моєму супі.

Була в супермаркеті, мені сказали: розплатитися можна будь-якою картою.
Дістала бубнового туза …
Хто-небудь може забрати мене з поліції?

Журнал “Працівниця” оголосив конкурс “Хто краще знає жінку” серед чоловічого населення. Переможець конкурсу – Петя Іванов, г.Сиктивкар, 10 років!
Обурений читач Григорій Семенович:
“Мені 65 (!) Років. У мене 5 дітей, 8 онуків. Я знаю жінок з 12 років. Я вкрай обурений!”
Відповідь редакції:
“Шановний Григорію Семеновичу!
На наш першого питання “Де у жінок самі кучеряве волосся?” Петя Іванов відповів правильно: “У Південній Африці”. А Ви що відповіли? Та ще й намалювали …
На другий питання конкурсу “Який найголовніший жіночий орган Ви знаєте?” Петя Іванов відповів правильно: “Всесвітня федерація жінок при ООН”. А Ви що відповіли? Та ще й намалювали …
І нарешті, на третьому питання конкурсу “Якого важливої події з нетерпінням чекає кожна жінка кожен місяць?” Петя Іванов відповів правильно: “Виходу нового номера журналу” Працівниця “. А Ви що відповіли? Спасибі, що не намалювали !!!”

На одеській митниці.
– Що ви везете, громадянин Рабинович? Зброя, наркотики є?
– Зараз я подивлюся, просто мені мама валізу збирала …

Якщо в дамську сумочку не влазить буханка хліба, баночка майонезу, заморожена курка, то фігня це, а не сумочка.

– Нюма, негайно перестань мучити кішку і займися скрипкою!
– Я і займаюся скрипкою.
– Тоді негайно перестань мучити скрипку і йди їсти!

А ви знаєте, що проблема країни не в тому, що вона не може нагодувати бідних, а в тому, що багаті ніяк не можуть нажертися.

Приїжджий запитує у одесита:
– Так де ж ваша Дерибасівська?
– Так вам же ще їхати на тролейбусі сім зупинок! – Відповідає одесит.
– Що ви говорите?! – Обурюється приїжджий. – Я їхав на тролейбусі, і мені сказали, що потрібно виходити.
– А ви, коли їхали, сиділи або стояли?

– Ти готувати щось вмієш?
– Так, я дуже смачно ріжу ковбасу!

– Люба, ти спиш?
– Ні.
– Це добре, тоді повернись до мене.
– Не хочу, ти цибулю їв.
– А ти горох!

– Виходь за мене заміж?
– Чоловік, за якого я вийду, повинен бути відважний і кмітливий!
– А ти вже не пам’ятаєш, як я врятував тебе, коли ти тонула?
– Ну так, ти відважний, але це ще не означає, що ти кмітливий.
– А як ти думаєш, хто човен перевернув?

З мого вікна відкривається вид на чотири під’їзди, біля кожного під’їзду по дві лавочки, на яких зазвичай гніздяться бабульки.
Тепер я стан погоди вимірюю в “бабках”. 2-3 бабки – вітряно, холодно, сиро. Погожий літній деньок – це 8-10 бабок і більше. Нуль бабок – значить або на вулиці пекельний апокаліпсис, або по телевізору Олену Малишеву показують.

Допитують чукчу через перекладача:
– Чукча, де ти сховав золото?
Перекладач: Чукча, де ти сховав золото?
Чукча: Не скажу !!
Перекладач: Він не скаже.
– Якщо ти не скажеш, де золото, ми тебе вб’ємо!
Перекладач: Чукча, вони тебе вб’ють, якщо ти їм не скажеш, де золото.
Чукча: Золото зарито біля входу юрту.
Перекладач: Стріляйте, сволочі, все одно не скажу!

– Капець, мене Катя брoсіла.
– Та годі! У тебе таких ще сто буде!
– Ще сто ?! Господи, та за що ???

Заходжу в банк і бачу рекламу: “МИ ДОВІРЯЄМО СВОЇМ КЛІЄНТАМ”! … А ручка до столу прив’язана …

У готелі постоялець звертається до чергової по поверху:
– Послухайте, в моєму ліжку клопи!
– За цю ціну ви хочете мати в ліжку Джулію Робертс?

– Приходь сьогодні ввечері до мене – заночуємо, попустуємо!
– А тато з мамою дозволить ???
– Нє, з мамою звичайно не дозволить, зі мною будеш спати.

Дістали два миші пляшку горілки, а закуски не знайшли. Прибігли до вороні, а та на дереві з шматком сиру сидить.
– Гей, ворона, випити хочеш?
– Так!
Сир впав, миші з сиром були такі. На наступний день миші знову:
– Ворона, випити хочеш?
Ворона мовчить. Одна миша наливає горілку в стакан і питає:
– Тобі повний?
– Так!
Сир впав і миші з сиром були такі. На наступний день миші знову вдаються і запитують:
– Ворона, пити будеш?
Ворона мовчить. Миша наливає в склянку горілки і питає:
– Тобі повний?
Ворона мовчить.
– Ворона, ти що, думаєш ми тебе знову обдурити хочемо?
– Та-ааааак …

 

– Милий, у тебе в ванній висять два рушники з позначкою “М” і “Ж”. Я витиралася з позначкою “Ж”, адже “М” – це для чоловіків?
– Ні, “М” – це для морди …

– Ой, які у вас гарні трійнята … Як ви так філігранно копії зробили?
Мужик, сердито:
– Трафарет показати?

– Дівчина, а що ви робите в суботу ввечері?
– Зателефонуйте в неділю. Я розповім.

– Я сьогодні не виспався …
– А причина?
– Причина теж не виспалась …

Дзвінок до турфірми:
– Вітаю. Нам би хотілося відпочити!
– А якою сумою Ви розташовуєте?
– Ну … тисячу рублів!
– Відпочивайте!

– Сьогодні, нарешті, ти не будеш дорікати, що я погано готую!
– Правда? А що у нас на вечерю?
– Нічого!

– І як дівчинку назвали?
– Аврора.
– Богиня ранкової зорі …
– Ось все так кажуть, а дідусь заладили: крейсер, крейсер …

Біжить курка, за нею півень. Курка думає:
– Якщо зупинюся, то подумає ДОСТУПНА, якщо утечу дурепою буду! … Гаразд, побіжу і спіткнусь!

У моєї дівчини у ванній висять шостій рушників: для особи, для волосся, для тіла, для ніг, для інтиму і для чогось ще шосте … забув! А, точно, для мене!

– Та що ти про себе думаєш ?! Та ти останній, з ким би я погодилася переспати! – Гаразд, буду всіх попереджати, щоб за мною не займали …

Я сьогодні відчуваю себе сорокою: кашу зварила, діток нагодувала, спати поклала, дров наколола, води наносила … Ось тепер сиджу і думаю – цьому давати?

СМС:
– Мамо, а ти скоро з роботи повернешся? Я скучила.
– Не встигнете, буду через п’ять хвилин! Привіт Серьожі!

До людей потрібно ставитися, як до котів: чи не напаскудив – вже молодець!

– Млинець! – Сказав слон, наступивши на Колобка.

Фірма шукає нового бухгалтера! І старого теж!

Першокласник читає склади:
– БА, БУ, Б …
Батько з кімнати:
– А чи не зарано?

– Дорогий, ти купив мені на 8 березня подарунок?
– Звичайно Люба.
– А він мені сподобається?
– Якщо не сподобається, віддаси мені, я про такий спінінг давно мріяв.

– Чоловік! Ну скільки можна дзвонити?! .. І як з Вами дружина спить – Ви ж весь час не туди потрапляєте! ..

– Привіт як справи?
– Так, ось, у відпустку збираюся.
– З дружиною або на відпочинок?

– Дорогий, а давай пограємо в рольові ігри?
– Давай!
– Ти Шеф-кухар ресторану, а я сплю.

Два мужика б’ються:
– Ти правда з моєю дружиною спав ?!
– Hу спав …
– Якби у мене був пістолет, я б тебе застрелив, якби у мене був ніж, я б тебе зарізав !!!
– А ти мене забодай …

Професорки медінституту на лекції:
– У чоловіка немає ознак позбавлення невинності, крім його нахабної, задоволеною пики …

– Альо! Можеш говорити?
– Можу.
– Тоді слухай …

– Ти так схудла! Це нова дієта?
– Так, морква, буряк і картопля.
– А що робила, варила або смажила?
– Копала.

– Все, досить дурницями займатися, треба гроші заробляти, – пробурмотів чарівник, розфарбовуючи свою чарівну паличку в чорно-білі смужки …

Рятувальник на човнової станції надривається в гучномовець:
– Човен 99 гребіть до берега !!! Ваш час закінчилося !!!
Човен 99 гребіть до берега !!! Ваш час закінчилося !!!
Підходить напарник і каже:
– Що ти кричиш? У нас же всього 70 човнів!
Рятувальник задумливо дивиться на нього. Потім знову кричить у гучномовець:
– Човен 66 !!! У Вас що – проблеми?

На уроці літератури: – Вовочка, що тобі відомо про Чехова і Пушкіна?
– Чехов – це місто, і Пушкін – це теж ніби місто.
– А хто ж тоді Толстой?
– А Толстой – це взагалі лев!

– Скільки мені років? Вгадайте.
– Навіть і уявити не можу.
– Моя дочка ходить у дитячий садок.
– Вона там завідуюча?

Приходить дочку додому:
– Мамо, я 3 рубля знайшла!
– Струси з спідниці солому і більше мамі ніколи не бреши – я в твої роки більше знаходила!

– Дорогий! Мене всі називають повною дурепою!
– Ну мила! Ніяка ти не повна! Ти струнка!

– Брешуть. Вони всі брешуть. Я вже другий тиждень мажу живіт «Фейрі», а жир так і не зникає!
– Маж «Досей». Якщо не видно різниці, то навіщо платити більше?

– Кума, ну як у тебе дочка влаштувалася?
– Відмінно … Чоловік любить, шуби купує, на курорти возить …
– А син? …
– А синові стерва попалася … Те шубу їй купи, то на курорт звози …

– Піди подивися, чим там кішка на кухні гримить.
– А ти її годувала?
– Ні.
– Значить, готує щось.

Переписка по ICQ:
– А тибе ні інтіресно, як я виглежу?
– Мені вистачає того, як ти пишеш!

Потрапили в яму вовк, лисиця і свиня … Лисиця дивиться на свиню і думає:
– М’ясо їсти, скільки небудь протримаємося, а там дивись, і видеремося … …
Вовк подивився на свиню:
– М’ясо є …
Подивився на лисицю:
– Баба є … Жити можна …
Свиня подивилася на обох і каже:
– Ну, мені тут робити нічого … Давайте хоч заспіваю …
Усі погодилися … Як свиня співає – не знали ні лисиця, ні вовк … А хрюшка як заверещить! Мисливці почули – прибігли, вовка та лисицю вбили … Остання думка згасаючого свідомості вовка:
– М’ясо було … Телиця була … Ні ось, шоу захотілося !!!

У мене все добре, мама.
Чоловік мене любить.
Я дрова не ношу, вони самі за мною літають!

Чебурашка дзвонить Гені:
– Гена, нам посилка прийшла. У ній десять апельсинів. Вісім тобі і вісім мені.
– Послухай, Чебурашка, вісім і вісім – це ж ніби і не десять буде?
– Нічого не знаю, свої восьмій я вже з’їв.

– Клянуся бути з тобою в багатстві і в розкоші, в радості і в щасті, … в Парижі і в Лондоні, в твоїх замках і на яхтах …
– Наречена! По тексту, за текстом …

– Вовочка! Ти навіщо назвав Машу дурепою? Зараз же підійди до неї і скажи, що тобі дуже шкода.
– Маша, мені дуже шкода, що ти дура!

– Ми з дружиною зустрілися на дискотеці …
– Ой, Як це романтично!
– Куди вже романтичніше? Я то думав, що вона сидить вдома з дітьми.

Чоловік: – От уяви. У тебе є класна машина. Така гарна.
Дружина: – Ну уявила, і що?
Чоловік: Так от. Ця машина тиждень не може їздити через профілактику. А в решту часу їздить тільки за настроєм. І як тобі?
Дружина: – А на фіг мені така машина?! … Стій! … Ти на що натякаєш ?!

Голос дружини із спальні:
– Де ти, мій принц?
Голос чоловіка з туалету:
– Тут я, моя принцеса! На білому коні!

Сидить мужик в коридорі школи, чекає доньку. Проходить повз вчителька і питає:
─ Ви дитину чекаєте?
─ Ні, це в мене такий живіт від пива.

Чоловік і дружина відзначають трідцатіпятілетія спільного життя. Чоловік каже:
– Пам’ятаєш, тридцять п’ять років тому, ми знімали дешеву квартирку, спали на дешевому дивані, дивилися чорно-білий телевізор … Зараз у нас є все – дорогий будинок, дорогі меблі, машина і плазмовий телевізор. Але тридцять п’ять років тому я спав з молоденькою 21-річною дівчиною, а тепер доводиться спати з 56-річною жінкою.
Дружина відповідає:
– Знайди собі для сну 21-річну, а вже я подбаю, щоб у тебе були дешева квартира, дешевий диван і чорно-білий телевізор.

– Дорогий, я щось не можу заснути.
– Це нормально … зло ніколи не дрімає!

Батько лає Вовочку:
– Ти затиснув дверима палець історику, спалив волосся географічці, облив фарбою костюм директору!
Вовочка:
– Я знайшов спосіб, щоб мене більше не залишали на другий рік, а постаралися щоб я швидше закінчив школу.

Дружина послала мене за равликами. Я зустрів друзів і на 3 дня пішов у запой.Наконец згадав про равликів, купив і пішов додому. Думав що сказати дружині. Дружина відкриває двері, я висипаю равликів на підлогу і, підганяючи їх руками, кажу:
– Ну от, дійшли нарешті! Заходимо, заходимо.

Викрали олігарха. Тащут його на озеро, вмокають голову в воду, і питають:
– Долари є?
– Ні.
– Євро є?
– Ні.
– Рублі є?
– Мужики ви глибше макайте або довше тримайте, нічого не видно.

– Вовочка, про що задумався?
– Та ось мрію, Марь Іванна. Написав би хто-небудь шлягер під назвою «Клізма».
– Це навіщо ще ?!
– Я б тоді написав на радіо: Дорога редакціє, поставте, будь ласка, «Клізму» нашому завучу Степаниде Василівні!

Трирічного Вовочку приводять в поліклініку здавати кров з пальчика. Медсестра протерла пальчик ваткою зі спиртом, потім вколола.
Вовочка подивився на медсестру, потім на пальчик:
– Ти чо, дура, зробила?! ..

– Рибка моя, а ну – ка скажи куди ти витратила мою всю зарплату?
– Дорогий, а рибки не вміють розмовляти!

На тренінгу з продажу софтів:
– Дівчата, ще раз нагадую – не треба питати у клієнта, що у нього стоїть, треба запитувати: “Яке програмне забезпечення у Вас встановлено?”

– Мам, завтра батьківські збори. Підеш?
– Ні, синку, ми краще на ці гроші з тобою в Туреччину з’їздимо!

– Тато-тато, а чому ми їмо картоплю в мундирі а наші сусіди по дачі постійно шашлики смажать?
– А це, синку, бо вони ледарі. Вони не хочуть садити, полоти і доглядати за картоплею

На жаль, у Зінаїди з ВДВшніком Андрієм нічого не вийшло. Тому що Зінаїда була не фонтан.

Група з 5 молодих і голодних студентів готова допомогти знищити будь санкційні продукти. Анонімно, особисті виїзди, гарантія 300%.

Мужик влаштовується на роботу. Начальник його запитує: – Горілку п’єш?
– А є?
– Так, ні, це я так, в принципі.
– А-а-а. В принципі, не п’ю.

Екскурсовод звертається до гостей: – Якщо шановні пані замовкнуть, ми почуємо шум Ніагарського водоспаду.

– Здалеку чоловік виглядав привабливим, але поблизу стало помітно, що його рука спотворена обручкою …

Виходять мужики з лісу, дивляться дід на пеньку сидить. Вони до нього:
– Дідусю, а як пройти в село?
– Ідіть прямо, там буде конопляне поле, відразу за ним – річка яка говорить .

У жінки три віки:
– Нервує батька.
– Дістаємо чоловіка.
– Бесім зятя.

Сподобалося тут мені вислів мого товариша з приводу своєї ваги:
– А я, – каже, – важу як радіо.
– ??? це як ?
– Ну, встану на ваги, а там – то 103,2, то 104,7.

Чоловіки більш вибагливі і примхливі. Жінку влаштує як чорне манто і білий автомобіль, так і навпаки. А чоловікові подавай пишні груди і плоский живіт, а навпаки – ніяк.

Блоха чоловікові (зітхаючи):
– У всіх подружок чоловіки як чоловіки, одна я, як лохушка: другу зиму доведеться ходити в старій собаці.

– А навіщо жінки з ранку пшикати балончиками на голову ??
– Це вони тарганів труять.

У літаку дуже скромний молодий чоловік ніяк не наважується заговорити з миловидної сусідкою. Нарешті, зібравшись з силами, він каже:
– Вибачте, а ви теж летите цим літаком?

– Гіві, про таблетки віагра знаєш? А для чого вони?
– Ну щоб ти міг 2-3 рази за ніч!
– Заспокійливе, чи що?

– Мені потрібен наповнювач для кота.
– Для туалету?
– Ні. Йому що-небудь пожерти.

– Ти де була, щось давно тебе не бачила?
– Так по роботі в Італію їздила.
– З тобою хоч не зустрічайся. Вічно настрій зіпсуєш!

– От скажи, навіщо ти їздив у відпустку зі своєю дівчиною? Адже це як у Тулу зі своїм самоваром!
– Зате я щодня пив чай!

У пологовому будинку щасливий батько:
– Бат-т-тюшки! Двійнята!
– Ні, поки один, -успокаівает його медсестра, а наступного разу приходьте тверезим!

– О котрій ти будеш вдома?
– Пора вже запам’ятати, що по п’ятницях я приходжу додому в суботу!

Ось так ходиш з дівчинкою в садок в одну групу, в школі в один клас, в коледжі в одній групі … В Одноклассниках дивлюся – їй 27 років, а мені 38 ..

– Вже йдете?
– Так.
– А чому так повільно?

Ранок. 8 березня. Муж – жене:
– Люба, чого б ти хотіла на 8 березня?
Дружина:
– Ну, дорогий, я б хотіла щось для моїх тоненьких пальчиків, для моєї довгої шиї, і для моїх рожевих вушок.
Чоловік думає:
– Ага! МИЛО!

Вовочка їде з батьками в машині:
– Мамо, дивись, літак полетів!
– Мамо, дивись, поїзд …
– Мамо, дивись, кінь …
– Тато, дивись … блондинка …

– Товаришу майор, у вас один черевик коричневий, а інший чорний! Сходіть додому перевзуйтє!
– Так я ходив – там те ж саме!

– Ви що, танцюєте під його дудку? ..
– Це не дудка, це – стовбур …

Водій жінці, ледь не потрапив під колеса його автомобіля: – Жінка, шо ви ходите по Одесі, як та корова по Індії ?!

Вовочка говорить батьку:
– Давай мамку виженемо, я цицьку НЕ смокчу, великий вже. Ти з нею не спиш, так навіщо її для сусіда годувати?

– У Вас можна зняти що-небудь зовсім близько до моря і недорого?
– Звичайно … Я Вам в човні постелю.

– Що чоловік хоче почути від дівчини?
– Тут все так дорого .. Може, відразу до мене?

Зустрічаються два друга:
– Чим займаєшся?
– Бізнесом. А ти?
– Я теж. У тебе що?
– Ресторанчик у центрі, елітний. Але якось мляво, кілька людей вдень, трохи більше ввечері. А у тебе?
– А в мене просто вал народу. Думаю розширюватися …
– Заздрю. Великий бізнес?
– Так, туалетна кабінка на площі Трьох вокзалів.

Наливаю кави. Дістаю шоколадку. Беру улюблену книгу і закриваюсь на кухні на півгодини:
– Маааам, ти що там робиш?
– Діти, я роблю для вас добру маму.

Офіс. Дев’ятій вечора. Два запарених бухгалтера готують річний звіт. Один відривається від монітора і запитує іншого:
– А скільки місяців у році?
– А? Що?
– Місяців у році? ..
– Десять … Без ПДВ …

– Дорогий, я вже готова до дітей.
– А я ні!!!
– Нічого не поробиш. Літо закінчується, треба їх забирати з села …

Коли чужий чоловік витрачає останню тисячу на феєрверки і шампанське, то він, чи розумієте, романтик, а коли свій – дебіл.

– Дорогий, мені наснилося, що на свято ти мені подарував кольє …
– Будеш себе добре вести, наступного сні, я тобі норкову шубу подарую.

– Як ти здав російська, ти ж повний нуль?
– С песал …

– Мама! Він йде!!!
– Нехай хліба купить …
– Мама! Він назавжди йде!
– Хрін з ним, сьогодні повечеряємо без хліба.

– Що було між вами?
– Нічого, навіть сорочки …

Чоловік довго сперечається з дружиною. Потім, змучений, здається:
– Гаразд, нехай буде по-твоєму …
– Пізно! Я вже передумала!

– Дорогий, я в магазин. Тобі взяти що-небудь смачненьке?
– Звичайно Люба. Тільки обережніше, на вулиці ожеледь! Дивись не розбий.

– Дорогий, хто дзвонив?
– Я так і не зрозумів. Якийсь мужик, синоптик чи що …
– А чого ти так вирішив?
– Питання дивний прозвучав: «Ну що, сонце, горизонт вже чистий?»

На званому вечорі дружина довго придивлялася до чоловіка і нарешті вигукнула:
– Просто важко повірити, щоб п`ять чарок горілки могли так змінити людину.
– Прости, дорога, але я випив тільки одну чарку.
– Так, але зате я випила пять …

Дружина пішла від чоловіка, але незабаром повернулася. Кається, просить вибачення. Чоловік:
– За те, що ти пішла з дому, я тебе пробачу, але за те, що повернулася – НІ-КОГ-ДА !!!

– Тільки в нас «угу» позначає «спасибі», «ой» перекладається як «вибачте», а шматочок хліба є другим столовим прибором.

– Тільки ти врахуй, я люблю червоне напівсолодке.
– Ага, а я чорні мереживні …

Іноземний турист ламаною російською питає у жителя невеликого сибірського містечка:
– Кажуть, у вашому місті є купа достопрімечьятельностей …
– Це так! А якщо зустрінете ведмедя на вулиці – буде дві купи!

Мужик заходить в рибальський магазин:
– Дівчина, у вас приманки силіконові?
– Чоловік! У мене все натуральне!

– Ви думаєте, що цибуля – це єдиний овоч, від якого плачуть? Ні, ви ще динею по морді не отримували!

– Чим відрізняється веселий байкер від сумного?
– У веселого байкера зуби в мошках!

– Ну як, Петро, урожай нинішнього року?
– Як ніколи! Мішок картоплі посадив, мішок зібрав, і ні
одна не пропала!

Розмова двох левів:
– Набридли мені ці нові росіяни, ганяють по савані, горілку п’ють, смітять, матюкаються.
– Так, а потім мобільник в животі дзвенить!

– Дорогий, ти пам’ятаєш, що у моєї мами завтра день народження?
– Блін, ну щороку, одне і те ж !!!

– Мама! У нас на сіннику голі!
– Не хвилюйся, донечко, напевно, якісь дикі.
– Тьотю, може бути і дика, але тато наш … домашній!

Йде лекція про шкоду алкоголю.
– Відомо чимало випадків, – говорить лектор – коли дружина йде від чоловіка, який п’є …
Голос із залу:
– І скільки для цього треба випити?

– Ти бігаєш вранці?
– Так. По квартирі з криками: «Я проспала!»

– Алло! Диспетчерська? Я застряг у ліфті між поверхами!
– Майстер буде через 30 хвилин. Ви тільки нікуди не йдіть.

У нашому місті відкрито “гарячу лінію” “Товариш по чарці”. Досвідчений собутильник підтримає розмову на одну з актуальних тем:
– Баби – дурепи;
– Футбол, хокей;
– Хто як нажерся;
– Анекдоти сороміцькі.
Можливий виїзд собутильника  додому і на роботу.

На уроці вчитель запитує:
– Що найбільше збуджує людину?
– Тіло голої жінки! – Відповідає Вовочка, що сидить на першій парті.
– Геть з класу! І приведи свого батька!
На наступний день Вовочка прийшов один і сів за останню парту.
– Ти чому не привів батька? Чому сів за останню парту? – Запитує вчитель.
– Тато сказав, що якщо вас не збуджує гола жінка, то ви – педик, і від вас потрібно триматися подалі.

Шепіт в кіно:
– Милий, що це ти такий холодний сьогодні?
– Тихо, тихо, все нормально. Це ти за ескімо схопилася.

Син приходить до батька і каже:
– Тато я твій пістолет на “Ролекс” поміняв “.
– Дурень, – відповідає батько – ось прийде хто небудь і скаже: “Твій тато козел, твоя мама коза”, а ти що скажеш: “Половина другого”?

– Мам, я пішов з Леркой гуляти!
– Шапку надіти не забудь!
– Ма, мені вже 25, я сам вирішу …
– Ти зрозумів, що я мала на увазі!

– Не подобається мені, коли дівчата налисо стрижуться.
– Ну чому ж, це дуже стильно!
– А в мене перша думка про воші …

– Мамо, а чим займається лелека, після того, як приніс дитину?
– Він лежить на дивані, дивиться телевізор, жере, п’є пиво і грає в танки …

– Петя, як розділити чотирьох картоплі на п’ятьох людей?
– Не знаю…
– Сідай, два!
Леночка! Те ж саме питання!
– Не знаю..
– Двійка! Абрамчик, як розділити чотирьох картоплі на п’ятьох?
– Потрібно зварити пюре!

Маленький хлопчик гуляє з татом по зоопарку і бачить зебру.
– Тато, дивись кінь мелірований!
– Це твоя мама кобила мелірована, а це, синку, зебра …

– Ну ось, мила, тепер коли ми одружені, ти можеш мені сказати скільки у тебе було чоловіків?
– А ти не будеш мене потім дорікати?
– Ні, не буду.
– Ну гаразд – сім.
– У сенсі я – сьомий?
– Та ні, що ти. Ти – четвертий…

Чоловік приходить в аптеку і запитує:
– У вас для жінок “Віагра” або щось в цьому роді є?
– У нас немає, але в ювелірному магазині за рогом можна щось підібрати…

…Одна знайома вирішила якось приколотися над своїм чоловіком – підклала йому в кишеню піджака свої трусики, щоб потім влаштувати жартівливу сцену ревнощів і подивитися як він відреагує. Жарт вдався – він у всьому зізнався.

– Що збираєшся в суботу робити?
– Виспатися.
– А що потім?
– А потім неділя.

На вечірці у нових росіян присутній дама – знавець хороших манер. Під кінець вечора до неї підходить господар:
– Ну як?
Вона: – Так, в принципі все нормально, тільки немає щипців. Уявіть, чоловіки йдуть в туалет, самі розумієте, за що руками тримаються, а потім цими ж руками цукор беруть.
НР: – Зрозумів, врахую.
На наступній вечірці він знову підходить до цієї дами:
– Ну як?
Вона: – Все чудово, але знову немає щипців.
НР: – Як немає? Є.
– Чому ж я їх не бачу? Де вони?
– Як де? В сортирі!

В автобусі:
– Дівчина, Ви не сходите?
– Дякую, я з ранку вже сходила…

– Скажи мені, ти взагалі дружиш з мізками?
– У сенсі? Це частина мене, з нею треба дружити, це, блін, так само, як “ти дружиш з пальцем?” або “а ти дружиш з волоссям на нозі?”, вранці прокидаєшся і говориш: “Привіт, мізки, як вам спалося? Що їсти будемо?”
– Все-все, заспокойся. Не дружиш, і не треба…

Розмовляють двоє приятелів:
– Ти коли бачиш привабливу жінку, ти її роздягаєш очима?
– Звичайно! Роздягаю, займаюся сексом, одружуся, знайомлюся з батьками, сварюся з тещею… в результаті розлучаюся. Після чого бачити її вже не хочу.

Однокласниці дістали! Всі зустрінься з ними і зустрінься!! Треба було в школі давати!!!

— Для мене завжди авторитетом був чорний пояс мого батька!
— По карате?
— По дупі!

Пашу виховувала бабуся. Тому він уже в 7 років навчився в’язати спицями, гойдатися на кріслі-гойдалці і за 30 хвилин, крекчучи, засовувати нитку в голку.

Щоб позбавитися раз і назавжди від страшної, але нав’язливою зі своїми проблемами подруги дружини, досить запитати дружину мимохідь: “А де це наша Свєтка, з такою шикарною апетитною попкою? “.

– Кохана, я сьогодні спізнюся, йду з друзями на скачки.
– Не турбуйся, дзвонила твоя кобила, сказала, що скачки відміняються.

Мужик приходить скаржитися в магазин з купленої тиждень тому бензопилою:
– Я ось купив у вас інструмент. В інструкції написано, що з її допомогою можна за день розпиляти 5 кубометрів дров, а я як не стараюся, більше 3 не виходить.
Продавець:
– Ну давайте подивимося, і включає бензопилу.
Мужик:
– Ух ти!, а шо це вона у вас зажужжала?";
    }
}